In [3]:
import pandas as pd
import numpy as np

In [5]:
#dataframe a partir de um array

In [7]:
arr = np.random.randint(10,55,size=(4,4))

In [9]:
arr

array([[51, 31, 22, 36],
       [42, 53, 46, 51],
       [47, 24, 19, 45],
       [43, 48, 30, 53]])

In [27]:
df1 = pd.DataFrame(data=arr, index=['A','B','C','D'], columns=['W','X','Y','Z'])

In [29]:
df1

    W   X   Y   Z
A  51  31  22  36
B  42  53  46  51
C  47  24  19  45
D  43  48  30  53

In [31]:
#criação de DF a partir de lista

In [39]:
lista = [[10,20,30,40,50],[60,70,80,90,100]]

In [57]:
df2 = pd.DataFrame(data=lista,index=['A','B'],columns = ['V','W','X','Y','Z'])

In [59]:
df2

    V   W   X   Y    Z
A  10  20  30  40   50
B  60  70  80  90  100

In [61]:
#criação de DF atraves de dicionário

In [71]:
dados = {'produtos':['VideoGame','PC','teclado','mouse','microfone'],'preço':[2600,2450.90,99.90,75,129.90]
}

In [73]:
dados

{'produtos': ['VideoGame', 'PC', 'teclado', 'mouse', 'microfone'],
 'preço': [2600, 2450.9, 99.9, 75, 129.9]}

In [75]:
df3 = pd.DataFrame(data = dados)

In [77]:
df3

    produtos   preço
0  VideoGame  2600.0
1         PC  2450.9
2    teclado    99.9
3      mouse    75.0
4  microfone   129.9

In [79]:
#criação de uma nova coluna

In [81]:
df3['Custo'] = [1900,2000,40,56.50,95.4]

In [83]:
df3

    produtos   preço   Custo
0  VideoGame  2600.0  1900.0
1         PC  2450.9  2000.0
2    teclado    99.9    40.0
3      mouse    75.0    56.5
4  microfone   129.9    95.4

In [85]:
df3['Lucro'] = df3['preço'] = df3['Custo']

In [87]:
df3

    produtos   preço   Custo   Lucro
0  VideoGame  1900.0  1900.0  1900.0
1         PC  2000.0  2000.0  2000.0
2    teclado    40.0    40.0    40.0
3      mouse    56.5    56.5    56.5
4  microfone    95.4    95.4    95.4